Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
	// Notify app that stack is ready
	modMessagePostToMachine(the, NULL, 0, bleServerReadyEvent, NULL);
}

void xs_ble_server_close(xsMachine *the)
{
	modBLE ble = xsmcGetHostData(xsThis);
	if (!ble) return;

	gBLE = NULL;
	xsForget(ble->obj);
	xsmcSetHostData(xsThis, NULL);
	modMessagePostToMachine(ble->the, NULL, 0, bleServerCloseEvent, ble);
}

void xs_ble_server_destructor(void *data)
{
	modBLE ble = data;
	if (!ble) return;

	if (-1 != ble->conn_handle)
		sd_ble_gap_disconnect(ble->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	
	c_free(ble);
	gBLE = NULL;

	modBLEPlatformTerminate();
}

void xs_ble_server_disconnect(xsMachine *the)
{
	if (BLE_CONN_HANDLE_INVALID != gBLE->conn_handle)
		sd_ble_gap_disconnect(gBLE->conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

void xs_ble_server_get_local_address(xsMachine *the)
{
    ret_code_t err_code;
    ble_gap_addr_t addr;
    
	err_code = sd_ble_gap_addr_get(&addr);
	if (NRF_SUCCESS == err_code) {
		xsmcSetArrayBuffer(xsResult, (void*)&addr.addr[0], BLE_GAP_ADDR_LEN);
	}
}

void xs_ble_server_set_device_name(xsMachine *the)
{
    ret_code_t err_code;
	ble_gap_conn_sec_mode_t sec_mode;
	const char *name = xsmcToString(xsArg(0));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode, name, c_strlen(name));
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble set device name failed");

	gBLE->deviceNameSet = 1;
}

void xs_ble_server_start_advertising(xsMachine *the)
{
    ret_code_t err_code;
	ble_gap_adv_data_t adv_data;
	ble_gap_adv_params_t adv_params;
	
	AdvertisingFlags flags = xsmcToInteger(xsArg(0));
	uint16_t intervalMin = xsmcToInteger(xsArg(1));
	uint16_t intervalMax = xsmcToInteger(xsArg(2));
	uint8_t filterPolicy = xsmcToInteger(xsArg(3));
	uint8_t *advertisingData = (uint8_t*)xsmcToArrayBuffer(xsArg(4));
	uint32_t advertisingDataLength = xsmcGetArrayBufferLength(xsArg(4));

	c_memset(&adv_data, 0, sizeof(ble_gap_adv_data_t));
	c_memmove(&gBLE->adv_data[0], advertisingData, advertisingDataLength);
	adv_data.adv_data.p_data = &gBLE->adv_data[0];
	adv_data.adv_data.len = advertisingDataLength;
	if (xsmcTest(xsArg(5))) {
		uint8_t *scanResponseData = (uint8_t*)xsmcToArrayBuffer(xsArg(5));
		uint32_t scanResponseDataLength = xsmcGetArrayBufferLength(xsArg(5));

		c_memmove(&gBLE->scan_rsp_data[0], scanResponseData, scanResponseDataLength);
		adv_data.scan_rsp_data.p_data = &gBLE->scan_rsp_data[0];
		adv_data.scan_rsp_data.len = scanResponseDataLength;
	}

	switch(filterPolicy) {
		case kBLEAdvFilterPolicyWhitelistScans:
			filterPolicy = BLE_GAP_ADV_FP_FILTER_SCANREQ;
			break;
		case kBLEAdvFilterPolicyWhitelistConnections:
			filterPolicy = BLE_GAP_ADV_FP_FILTER_CONNREQ;
			break;
		case kBLEAdvFilterPolicyWhitelistScansConnections:
			filterPolicy = BLE_GAP_ADV_FP_FILTER_BOTH;
			break;
		default:
			filterPolicy = BLE_GAP_ADV_FP_ANY;
			break;
	}

	// If whitelist filtering is enabled, we cannot use LE Limited or General discoverable modes
	// Avoid the resulting BLE_ERROR_GAP_DISCOVERABLE_WITH_WHITELIST error by ensuring these modes are not enabled
	// https://devzone.nordicsemi.com/f/nordic-q-a/33606/updating-advertising-data-manuf-spec-data-in-sdk15/133504#133504
	// @@ TBD - Try enforcing this at the app level or binding layer if the behavior is portable
	if (BLE_GAP_ADV_FP_ANY != filterPolicy) {
		uint16_t i = 0;
		uint8_t *adv_ptr = &gBLE->adv_data[0];
		uint8_t *adv_end = adv_ptr + advertisingDataLength;
		while (adv_ptr < adv_end) {
			uint8_t adv_length = adv_ptr[0];
			uint8_t adv_type = adv_ptr[1];
			if (BLE_GAP_AD_TYPE_FLAGS == adv_type) {
				adv_ptr[2] &= ~(BLE_GAP_ADV_FLAG_LE_LIMITED_DISC_MODE | BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE);
				break;
			}
			adv_ptr += adv_length;
		}
	}
	
    c_memset(&adv_params, 0, sizeof(ble_gap_adv_params_t));
    adv_params.filter_policy   = filterPolicy;
    adv_params.interval        = intervalMin;

	if (flags & (LE_LIMITED_DISCOVERABLE_MODE | LE_GENERAL_DISCOVERABLE_MODE))
		adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
	else
		adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;

	err_code = sd_ble_gap_adv_set_configure(&gBLE->adv_handle, &adv_data, &adv_params);
	if (NRF_SUCCESS == err_code)
		err_code = sd_ble_gap_adv_start(gBLE->adv_handle, APP_BLE_CONN_CFG_TAG);
	
	if (NRF_SUCCESS != err_code)
		xsUnknownError("ble start advertising failed");
}
	
void xs_ble_server_stop_advertising(xsMachine *the)
{
    ret_code_t err_code;
    
	err_code = sd_ble_gap_adv_stop(gBLE->adv_handle);
	if (NRF_ERROR_INVALID_STATE != err_code)
		xsUnknownError("ble stop advertising failed");
}

void xs_ble_server_characteristic_notify_value(xsMachine *the)
{
	uint16_t handle = xsmcToInteger(xsArg(0));
	uint16_t notify = xsmcToInteger(xsArg(1));
	ble_gatts_hvx_params_t hvx_params;
	uint16_t hvx_len = xsmcGetArrayBufferLength(xsArg(2));
	ret_code_t err_code;

	c_memset(&hvx_params, 0, sizeof(hvx_params));
	hvx_params.handle = handle;
	hvx_params.type   = (notify ? BLE_GATT_HVX_NOTIFICATION : BLE_GATT_HVX_INDICATION);
	hvx_params.offset = 0;
	hvx_params.p_len  = &hvx_len;
	hvx_params.p_data = xsmcToArrayBuffer(xsArg(2));
	err_code = sd_ble_gatts_hvx(gBLE->conn_handle, &hvx_params);
#if LOG_GATTS
	if (NRF_SUCCESS != err_code) {
		LOG_GATTS_MSG("sd_ble_gatts_hvx failed, err_code =");
		LOG_GATTS_INT(err_code);
	}
#endif
}

void xs_ble_server_deploy(xsMachine *the)
{
    ret_code_t err_code = NRF_SUCCESS;
    ble_uuid128_t ble_uuid_128;
    ble_add_char_params_t add_char_params;
    ble_add_descr_params_t add_desc_params;
	ble_add_char_user_desc_t add_user_desc;
	ble_gatts_char_pf_t char_presentation_format;
	uint8_t permissions;
	uint16_t properties;
	uint16_t char_handle;
	uint16_t att_handle_index = 0;
					
	if (!gBLE->deployServices) return;
	
	for (uint16_t i = 0; i < service_count; ++i) {
		gatts_attr_db_t *gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][0];
		attr_desc_t *att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
		ble_uuid_t ble_service_uuid;

		if (UUID_LEN_16 == att_desc->uuid_length && 0x00 == att_desc->value[0] && 0x18 == att_desc->value[1])
			continue;	// don't register gap service
			
		if (UUID_LEN_16 == att_desc->length) {
			uint16_t service_uuid = *(uint16_t*)att_desc->value;
			BLE_UUID_BLE_ASSIGN(ble_service_uuid, service_uuid);
		}
		else if (UUID_LEN_128 == att_desc->length) {
			uint8_t uuid_type;
			ble_uuid_128 = *(ble_uuid128_t*)att_desc->value;
			err_code = sd_ble_uuid_vs_add(&ble_uuid_128, &uuid_type);
			if (NRF_SUCCESS != err_code)
				goto bail;
				
			ble_service_uuid.type = uuid_type;
			ble_service_uuid.uuid = (att_desc->value[13] << 8) | att_desc->value[12];
		}
		else
			xsUnknownError("unsupported uuid size");

		err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_service_uuid, &service_handles[i]);
		if (NRF_SUCCESS != err_code)
			goto bail;

		for (uint16_t j = 1; j < attribute_counts[i]; ++j) {
			gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][j];
			att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;

			if (0 == c_memcmp(att_desc->uuid_p, &character_declaration_uuid, UUID_LEN_16)) {
				uint8_t attIndexUserDescription = 0;
				uint8_t attIndexPresentationFormat = 0;
				properties = *att_desc->value;
				
				++j;	// advance to characteristic value
				gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][j];
				att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
				permissions = att_desc->perm;
				
				c_memset(&add_char_params, 0, sizeof(add_char_params));
				if (UUID_LEN_128 == att_desc->uuid_length) {
					add_char_params.uuid_type	= ble_service_uuid.type;
					add_char_params.uuid		= (att_desc->uuid_p[13] << 8) | att_desc->uuid_p[12];
				}
				else {
					add_char_params.uuid		= *(uint16_t*)att_desc->uuid_p;
				}
				add_char_params.max_len			= att_desc->max_length;
				add_char_params.init_len		= att_desc->length;
				add_char_params.p_init_value	= att_desc->value;
				add_char_params.is_var_len		= (NULL == att_desc->value);
				add_char_params.is_defered_read = (NULL == att_desc->value);
				add_char_params.is_defered_write = (NULL == att_desc->value);
				
				add_char_params.char_ext_props.wr_aux = (properties & GATT_CHAR_PROP_BIT_EXT_PROP ? 1 : 0);
				setAttributeProperties(&add_char_params.char_props, properties);
				setAttributePermissions(&add_char_params.read_access, &add_char_params.write_access, &add_char_params.cccd_write_access, permissions);

				att_handles[att_handle_index].service_index = i;
				att_handles[att_handle_index].att_index = j;
				
				// Add characteristic user description and/or presentation format descriptors
				for (uint16_t k = j + 1; k < attribute_counts[i]; ++k) {
					gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][k];
					att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
					
					if (0 == c_memcmp(att_desc->uuid_p, &character_declaration_uuid, UUID_LEN_16)) {
						break;
					}
					else if (0 == c_memcmp(att_desc->uuid_p, &character_user_descriptor_uuid, UUID_LEN_16)) {
						uint16_t user_desc_properties = 0;
						permissions = att_desc->perm;
						add_user_desc.max_size = att_desc->max_length;
						add_user_desc.size = att_desc->length;
						
						// Inherit properties from characteristic
						if (properties & GATT_CHAR_PROP_BIT_READ)
							user_desc_properties |= GATT_CHAR_PROP_BIT_READ;
						if (properties & GATT_CHAR_PROP_BIT_WRITE)
							user_desc_properties |= GATT_CHAR_PROP_BIT_READ;
							
						// Unlike other attributes, the user description descriptor appears to require
						// non-deferred reads and writes.
						add_user_desc.p_char_user_desc = att_desc->value;
						add_user_desc.is_var_len = 1;
						add_user_desc.is_defered_read = 0;
						add_user_desc.is_defered_write = 0;
						add_user_desc.is_value_user = 1;
						setAttributeProperties(&add_user_desc.char_props, user_desc_properties);
						setAttributePermissions(&add_user_desc.read_access, &add_user_desc.write_access, NULL, permissions);
						
