Moddable-OpenSource/moddable/modules/network/ble/nrf52/modBLEServer.c
						add_char_params.p_user_descr = &add_user_desc;
						attIndexUserDescription = k;
					}
					else if (0 == c_memcmp(att_desc->uuid_p, &character_presentation_format_uuid, UUID_LEN_16)) {
						char_presentation_format.format = att_desc->value[0];
						char_presentation_format.exponent = att_desc->value[1];
						char_presentation_format.unit = (att_desc->value[2] << 8) | att_desc->value[3];
						char_presentation_format.name_space = att_desc->value[4];
						char_presentation_format.desc = (att_desc->value[5] << 8) | att_desc->value[6];

						add_char_params.p_presentation_format = &char_presentation_format;
						attIndexPresentationFormat = k;
					}
				}

				err_code = characteristic_add(service_handles[i], &add_char_params, &att_handles[att_handle_index].handles);
				if (NRF_SUCCESS != err_code)
					goto bail;

				char_handle = att_handles[att_handle_index].handles.value_handle;
				
				// If the user description descriptor was added by characteristic_add() above,
				// add an att_handles entry for this descriptor so we can match this descriptor by name
				// on subsequent read and write operations.
				if (BLE_GATT_HANDLE_INVALID != att_handles[att_handle_index].handles.user_desc_handle) {
					++att_handle_index;
					c_memset(&att_handles[att_handle_index].handles, 0, sizeof(ble_gatts_char_handles_t));
					att_handles[att_handle_index].handles.value_handle = att_handles[att_handle_index - 1].handles.user_desc_handle;
					att_handles[att_handle_index].service_index = i;
					att_handles[att_handle_index].att_index = attIndexUserDescription;
				}
				
				// If the presentation format descriptor was added by characteristic_add() above,
				// there doesn't seem to be a way to find the presentation format descriptor handle.
				// Create an empty att_handles entry for this descriptor.
				if (0 != attIndexPresentationFormat) {
					++att_handle_index;
					c_memset(&att_handles[att_handle_index].handles, 0, sizeof(ble_gatts_char_handles_t));
					att_handles[att_handle_index].service_index = i;
					att_handles[att_handle_index].att_index = attIndexPresentationFormat;
				}

				++att_handle_index;
				
				// Add other descriptors
				for (uint16_t k = j + 1; k < attribute_counts[i]; ++k) {
					gatts_attr_db = (gatts_attr_db_t*)&gatt_db[i][k];
					att_desc = (attr_desc_t*)&gatts_attr_db->att_desc;
					if (0 == c_memcmp(att_desc->uuid_p, &character_declaration_uuid, UUID_LEN_16)) {
						j = k - 1;	// will be incremented by main loop
						break;
					}
					else if (0 == c_memcmp(att_desc->uuid_p, &character_client_config_uuid, UUID_LEN_16)) {
						// CCCD attributes are automatically added by characteristic_add().
					}
					else if (0 == c_memcmp(att_desc->uuid_p, &character_extended_properties_uuid, UUID_LEN_16)) {
						// Characteristic extended property descriptors are automatically added by characteristic_add().
					} 
					else if (0 == c_memcmp(att_desc->uuid_p, &character_user_descriptor_uuid, UUID_LEN_16)) {
						// Characteristic user description descriptors are added above.
					} 
					else if (0 == c_memcmp(att_desc->uuid_p, &character_presentation_format_uuid, UUID_LEN_16)) {
						// Characteristic presentation format descriptors are added above.
					}
					else {
						permissions = att_desc->perm;
						c_memset(&add_desc_params, 0, sizeof(add_desc_params));
						if (UUID_LEN_128 == att_desc->uuid_length) {
							add_desc_params.uuid_type	= ble_service_uuid.type;
							add_desc_params.uuid		= (att_desc->uuid_p[13] << 8) | att_desc->uuid_p[12];
						}
						else {
							add_desc_params.uuid		= *(uint16_t*)att_desc->uuid_p;
						}
						add_desc_params.max_len			= att_desc->max_length;
						add_desc_params.init_len		= att_desc->length;
						add_desc_params.p_value			= att_desc->value;
						add_desc_params.is_var_len		= (NULL == att_desc->value);
						add_desc_params.is_defered_read	= (NULL == att_desc->value);
						setAttributePermissions(&add_desc_params.read_access, &add_desc_params.write_access, NULL, permissions);

						att_handles[att_handle_index].service_index = i;
						att_handles[att_handle_index].att_index = j;
						
						err_code = descriptor_add(char_handle, &add_desc_params, &att_handles[att_handle_index].handles.value_handle);
						if (NRF_SUCCESS != err_code)
							goto bail;
							
						++att_handle_index;
					}
				}
			}
		}
	}
	
bail:
	if (NRF_SUCCESS != err_code)
		xsUnknownError("services deploy failed");
}

void xs_ble_server_set_security_parameters(xsMachine *the)
{
	uint8_t encryption = xsmcToBoolean(xsArg(0));
	uint8_t bonding = xsmcToBoolean(xsArg(1));
	uint8_t mitm = xsmcToBoolean(xsArg(2));
	uint8_t iocap = xsmcToInteger(xsArg(3));
	uint16_t err;
	
	gBLE->encryption = encryption;
	gBLE->bonding = bonding;
	gBLE->mitm = mitm;
	gBLE->iocap = iocap;

#if (NRF_BLE_LESC_ENABLED == 1)
	if (mitm && (iocap == DisplayYesNo))
		modLog("# warning: LE secure connections require a Nordic SDK patch. Refer to the Moddable nRF52 README.md for details.");
#endif

	err = modBLESetSecurityParameters(encryption, bonding, mitm, iocap);
	if (NRF_SUCCESS != err)
		xsUnknownError("invalid security params");
}

void xs_ble_server_passkey_input(xsMachine *the)
{
//	uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint32_t digits = xsmcToInteger(xsArg(1));
	char passkey[BLE_GAP_PASSKEY_LEN + 1];
	
	itoa(digits, passkey, 10);
	sd_ble_gap_auth_key_reply(gBLE->conn_handle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, passkey);
}

void xs_ble_server_passkey_reply(xsMachine *the)
{
	//uint8_t *address = (uint8_t*)xsmcToArrayBuffer(xsArg(0));
	uint8_t confirm = xsmcToBoolean(xsArg(1));
	sd_ble_gap_auth_key_reply(gBLE->conn_handle, (confirm ? BLE_GAP_AUTH_KEY_TYPE_PASSKEY : BLE_GAP_AUTH_KEY_TYPE_NONE), NULL);
}

void xs_ble_server_get_service_attributes(xsMachine *the)
{
	ret_code_t err_code;
	uint16_t serviceIndex;
	uint8_t found = false;
	uint16_t length = xsmcGetArrayBufferLength(xsArg(0));
	uint8_t *buffer = xsmcToArrayBuffer(xsArg(0));

	xsmcVars(2);
	xsmcSetNewArray(xsResult, 0);

	for (serviceIndex = 0; !found && (serviceIndex < service_count); ++serviceIndex) {
		const gatts_attr_db_t *attr = &gatt_db[serviceIndex][0];
		if (attr->att_desc.length == length && 0 == c_memcmp(buffer, attr->att_desc.value, length)) {
			found = true;
			break;
		}
	}
	if (!found) return;

	for (uint16_t i = 0; i < handles_count; ++i) {
		ble_uuid_t uuid;
		ble_gatts_value_t gatts_value;
		uint16_t handle;
		
